# Pandas DataFrame apply() applymap()

In [1]:
# map apply applymap over the dataframe

In [2]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
data = pd.DataFrame({"Courses":["Spark","PySpark","Hadoop","Python","Pandas","Hadoop","Spark","Python",np.nan], "Fee":[22000,25000,23000,24000,26000,25000,25000,22000,1500], "Duration":['30days','50days','55days','40days','60days','35days','30days','50days','40days'],"Discount":[1000.0,2300.0,1000.0,1200.0,2500.0,np.nan,1400.0,1600.0,0.0]})

In [6]:
data

   Courses    Fee Duration  Discount
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
2   Hadoop  23000   55days    1000.0
3   Python  24000   40days    1200.0
4   Pandas  26000   60days    2500.0
5   Hadoop  25000   35days       NaN
6    Spark  25000   30days    1400.0
7   Python  22000   50days    1600.0
8      NaN   1500   40days       0.0

In [7]:
data.Fee

0    22000
1    25000
2    23000
3    24000
4    26000
5    25000
6    25000
7    22000
8     1500
Name: Fee, dtype: int64

In [8]:
type(data.Fee)

pandas.core.series.Series

In [9]:
# map function can be applicable to the pandas series.

In [10]:
data["Fee"].map(lambda x:x+200)

0    22200
1    25200
2    23200
3    24200
4    26200
5    25200
6    25200
7    22200
8     1700
Name: Fee, dtype: int64

In [11]:
# 200 is added

In [12]:
# To apply the map to the dataframe

In [13]:
data[["Fee","Discount"]]

     Fee  Discount
0  22000    1000.0
1  25000    2300.0
2  23000    1000.0
3  24000    1200.0
4  26000    2500.0
5  25000       NaN
6  25000    1400.0
7  22000    1600.0
8   1500       0.0

In [14]:
type(data[["Fee","Discount"]])

pandas.core.frame.DataFrame

In [15]:
data[["Fee","Discount"]].map(lambda x:x+200)

AttributeError: 'DataFrame' object has no attribute 'map'

In [16]:
# See we can't able to apply the map to the dataframe

In [17]:
data[["Fee","Discount"]].apply(lambda x:x+200)

     Fee  Discount
0  22200    1200.0
1  25200    2500.0
2  23200    1200.0
3  24200    1400.0
4  26200    2700.0
5  25200       NaN
6  25200    1600.0
7  22200    1800.0
8   1700     200.0

In [18]:
data

   Courses    Fee Duration  Discount
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
2   Hadoop  23000   55days    1000.0
3   Python  24000   40days    1200.0
4   Pandas  26000   60days    2500.0
5   Hadoop  25000   35days       NaN
6    Spark  25000   30days    1400.0
7   Python  22000   50days    1600.0
8      NaN   1500   40days       0.0

In [19]:
# So for the dataframe, we can use apply function

In [20]:
# Also we can apply for a series

In [21]:
data["Fee"].apply(lambda x:x+200)

0    22200
1    25200
2    23200
3    24200
4    26200
5    25200
6    25200
7    22200
8     1700
Name: Fee, dtype: int64

In [23]:
data[["Fee","Discount"]].applymap(lambda x:x+200)

     Fee  Discount
0  22200    1200.0
1  25200    2500.0
2  23200    1200.0
3  24200    1400.0
4  26200    2700.0
5  25200       NaN
6  25200    1600.0
7  22200    1800.0
8   1700     200.0

# Main difference between map,apply,applymap

map => Only can work in the Series
applymap => Only can work in the DataFrame
apply => Can work both in the Series and DataFrame

applymap is element wise for the dataframe. This is slightly faster than apply in some cases.

In [24]:
# When the fee is greater than 23000, it is high fees. Less than 23000 is low fees

In [25]:
def classify_fee(x,t):
    if(x > t):
        return "high"
    else:
        return "low"

In [26]:
data["Fee"].applymap(classify_fee, t = 23000) # t is a threshold value

AttributeError: 'Series' object has no attribute 'applymap'

In [27]:
# applymap not applicable to Series

In [28]:
data[["Fee","Discount"]].applymap(classify_fee, t = 23000)

    Fee Discount
0   low      low
1  high      low
2   low      low
3  high      low
4  high      low
5  high      low
6  high      low
7   low      low
8   low      low

In [29]:
data

   Courses    Fee Duration  Discount
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
2   Hadoop  23000   55days    1000.0
3   Python  24000   40days    1200.0
4   Pandas  26000   60days    2500.0
5   Hadoop  25000   35days       NaN
6    Spark  25000   30days    1400.0
7   Python  22000   50days    1600.0
8      NaN   1500   40days       0.0

In [31]:
# Actually, here 5th record is NaN. But that also considered as low. To avoid that,

In [30]:
data[["Fee","Discount"]].applymap(classify_fee, t = 23000, na_action="ignore")

    Fee Discount
0   low      low
1  high      low
2   low      low
3  high      low
4  high      low
5  high      NaN
6  high      low
7   low      low
8   low      low